Revit 2026 API

# TransformBasisZ Property

---

The basis of the Z axis of this transformation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ BasisZ { get; set; }
```
```vb
Public Property BasisZ As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ BasisZ {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member BasisZ : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the transform is internally marked as read-only. |

The Z axis of the old coordinate system in the new coordinate system, or the 3rd column of the conventional 3x4 matrix representation.

#### Reference

Transform Class

Autodesk.Revit.DB Namespace